**** Answer
     #+BEGIN_SRC scheme :results value
     (/ (+ 5 4 (- 2 (- 3 (- 6 (/ 4 5))))) (* 3 (- 6 2) (- 2 7)))
     #+END_SRC

     #+RESULTS:
     : -11/50
